package Lesson3and4;

public class GIt {
    public static void main(String[] args) {
        //самый простой способ вывалить проект на гит свой проект



        //консольный гит
//инициализация git репозитория
        /*git init
        * если нжно что бы гит не контролировал какие либо папки
        * их нужно поместить в файл гитигнор
        * для тех кто работает со средой это файлы из папки out, idea
        * и все остальные локальные файлы
        *
        * для сохранения состояния фалов команда git add
        * git status для проверки статуса фалов перед комитом
        * git commit -m "" фиксация изменений
        * удаление перемещение изменение содержимого делается через git add
        * для добавления удаленного репозитория используем git remote add
        * git remote add origin https://github.com/n1sjik/tst-git.git
        * основной удаленный репозиторий называется origin (это только имя удаленного репозитория)
        * выгружаем на гит командой
        * git push -u origin master
        * вводим log/pass от гитхаб
        * master основная ветка по-умолчанию (в нее выкладывается только рабочий код)
        * для загрузки с удаленного репозитория git clone "ссылка"
        * для получения изменений с удаленного репозитория в уже существующий
        * git pull
        * для скрытия своих изменений для коммита git stash
        * вернуть спрятанное git stash apply
        *
        * сброс
        * хард ресет к коммиту (указанному хэш суммой)
        * git reset --hard (Head~1(хэш сумма))
        *
        * git revert
        * создает новый коммит но отменяет изменения введеные прошлым коммитом
        * git log
        * в среде делается кнопкой version controll
        *
        * для просмотра проекта во время определенного коммита
        * git checkout хэш сумма
        * git checkout имя ветки
        * git checkout master
        * для пререключения на новую ветку с определенного коммита старой
        * git checkout -b "имя новой ветки" "хэш сумма"
        * git branch - список веток (активная отмечена *)
        * git push origin --delete для удаления с удаленного
        * git branch -d  для локального
        * для слияния
        * git merge имя другой ветки
        *
        *
        *
        * */



    }
}
